# GetLevelAssociationData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LevelAssociationData..::..GetLevelAssociationData Method
LevelAssociationData Class See Also
---
Returns LevelAssociationData associated with this element, if it exists.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public static LevelAssociationData GetLevelAssociationData(
	Element element
)
```

Visual Basic
---
```text
Public Shared Function GetLevelAssociationData ( _
	element As Element _
) As LevelAssociationData
```

Visual C++
---
```text
public:
static LevelAssociationData^ GetLevelAssociationData(
	Element^ element
)
```

# ### Parameters
element
    Type: Autodesk.Revit.DB..::..Element The element from which we try to obtain LevelAssociationData.
# Remarks
If the input element doesn't have LevelAssociationData than it retuns nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LevelAssociationData Class
Autodesk.Revit.DB Namespace